results/M3/M3-DP-20260920T1610Z/cases/dp040_coarse_a0/dictionaries/0.orig/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// AETHER template - upper-case placeholders between at-signs are filled by aether.cfd.case.

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1346.6385232 0 0);

boundaryField
{
    freestream
    {
        type            fixedValue;
        value           uniform (1346.6385232 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    "body_.*"
    {
        type            slip;
    }
    "(front|back)"
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }
}
